## Intermediate SQL

In [5]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

### Filtering Records

#### WHERE
* `WHERE` filtering clause

#### WHERE with comparison operators

In [6]:
# SELECT title
# FROM films
# WHERE release_year > 1960;
sql = """
SELECT title
FROM films
WHERE release_year > 1960
"""
run_statement(sql)

                                                0
0                                          Sheena
1                                          Splash
2             Star Trek III: The Search for Spock
3                                      The Bounty
4                                 The Cotton Club
...                                           ...
4844                                     Warcraft
4845                            X-Men: Apocalypse
4846  Xi you ji zhi: Sun Wukong san da Baigu Jing
4847                                  Yoga Hosers
4848                                  Zoolander 2

[4849 rows x 1 columns]

#### Comparisons operators

In [9]:
# SELECT title
# FROM films
# WHERE release_year <= 1960;
sql = """
SELECT title
FROM films
WHERE release_year <= 1960
"""
run_statement(sql)

                                                   0
0   Intolerance: Love's Struggle Throughout the Ages
1                     Over the Hill to the Poorhouse
2                                     The Big Parade
3                                         Metropolis
4                                      Pandora's Box
..                                               ...
72                                  Some Like It Hot
73                                   The Nun's Story
74                                      Elmer Gantry
75                                            Psycho
76                                     The Apartment

[77 rows x 1 columns]

#### Comparison operators

In [11]:
# SELECT title
# FROM films
# WHERE release_year = 1960;
sql = """
SELECT title
FROM films
WHERE release_year = 1960
"""
run_statement(sql)

               0
0   Elmer Gantry
1         Psycho
2  The Apartment

#### Comparison operators

In [12]:
# NOT = <>
# SELECT title
# FROM films
# WHERE release_year <> 1960
sql = """
SELECT title
FROM films
WHERE release_year <> 1960
"""
run_statement(sql)

                                                0
0                                          Sheena
1                                          Splash
2             Star Trek III: The Search for Spock
3                                      The Bounty
4                                 The Cotton Club
...                                           ...
4918                                     Warcraft
4919                            X-Men: Apocalypse
4920  Xi you ji zhi: Sun Wukong san da Baigu Jing
4921                                  Yoga Hosers
4922                                  Zoolander 2

[4923 rows x 1 columns]

#### Comparison operators
* `>` Greater than or after
* `<` Less than or before
* `=` Equal to
* `>=` Greater than or equal to
* `<=` Less than or equal to
* `<>` Not equal to

#### WHERE with strings
* Use single-quotes around strings we want to filter

In [13]:
# SELECT title
# FROM films
# WHERE country = 'Japan';
sql = """
SELECT title
FROM films
WHERE country = 'Japan'
"""
run_statement(sql)

                          0
0                     Akira
1             Seven Samurai
2         Tora! Tora! Tora!
3             Spirited Away
4                  Madadayo
5            Street Fighter
6    The Quick and the Dead
7         Princess Mononoke
8                  The Cure
9             Godzilla 2000
10    PokÃ©mon 3: The Movie
11     Howl's Moving Castle
12                 Steamboy
13          One Missed Call
14                    Ponyo
15    Harlock: Space Pirate
16                     R100
17               Trainwreck
18      Godzilla Resurgence
19      Godzilla Resurgence
20  The Secret Life of Pets
21  Yu-Gi-Oh! Duel Monsters

#### Order of execution

In [ ]:
# -- Written code:
# SELECT item
# FROM coats
# WHERE color = 'green'
# LIMIT 5;

In [ ]:
# -- Order of execution
# 3. SELECT item
# 1. FROM coats
# 2. WHERE color = 'green'
# 4. LIMIT 5;